In [11]:
import pandas as pd
import numpy as np
from env import host, user, password
from pydataset import data

url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [12]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

#### #1 Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [13]:
def get_db_url(user, password, host, db_name):
    return f'mysql+pymysql://{user}:{password}@{host}/{db_name}'
get_db_url(user,password,host, 'Mammals')
Mammals_url = get_db_url(user,password,host, 'Mammals')

In [17]:
def get_db_url(user, password, host, db_name):
    return f'mysql+pymysql://{user}:{password}@{host}/{db_name}'
url = get_db_url(user,password,host, 'employees')

#### #2 Use your function to obtain a connection to the employees database.

In [21]:
get_db_url(user,password,host, 'employees')
emp_url = get_db_url(user,password,host, 'employees')

#### #3 Once you have successfully run a query:

#### #3.a Intentionally make a typo in the database url. What kind of error message do you see?

#### #3.b b. Intentionally make an error in your SQL query. What does the error message look like?

#### #4 Read the employees and titles tables into two separate DataFrames.

In [27]:
employees_df = pd.read_sql('SELECT * FROM employees LIMIT 5', url)
employees_df

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [28]:
titles_df = pd.read_sql('SELECT * FROM titles LIMIT 5', url)
titles_df

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [33]:
employees_df = pd.read_sql('SELECT * FROM employees', url)
titles_df = pd.read_sql('SELECT * FROM titles', url)

#### #5 How many rows and columns do you have in each DataFrame? Is that what you expected?

In [35]:
employees_df.shape

(300024, 6)

In [36]:
titles_df.shape

(443308, 4)

#### #6 Display the summary statistics for each DataFrame

In [37]:
employees_df.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [46]:
employees_df.describe(include = 'all')

               emp_no  birth_date first_name last_name  gender   hire_date
count   300024.000000      300024     300024    300024  300024      300024
unique            NaN        4750       1275      1637       2        5434
top               NaN  1952-03-08     Shahab      Baba       M  1985-06-20
freq              NaN          95        295       226  179973         132
mean    253321.763392         NaN        NaN       NaN     NaN         NaN
std     161828.235540         NaN        NaN       NaN     NaN         NaN
min      10001.000000         NaN        NaN       NaN     NaN         NaN
25%      85006.750000         NaN        NaN       NaN     NaN         NaN
50%     249987.500000         NaN        NaN       NaN     NaN         NaN
75%     424993.250000         NaN        NaN       NaN     NaN         NaN
max     499999.000000         NaN        NaN       NaN     NaN         NaN

In [47]:
#this includes the desciption of only the int columns
employees_df.describe(exclude = np.number)

        birth_date first_name last_name  gender   hire_date
count       300024     300024    300024  300024      300024
unique        4750       1275      1637       2        5434
top     1952-03-08     Shahab      Baba       M  1985-06-20
freq            95        295       226  179973         132

#### #7 How many unique titles are in the titles DataFrame?

In [39]:
titles_df['title'].unique()
#this shows WHAT the unique titles are

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

In [40]:
len(titles_df['title'].unique())
#this shows HOW MANY unique titles there are

7

#### #8 What is the oldest date in the to_date column?

In [42]:
#this is one way
titles_df.to_date.sort_values().head(1)

16064    1985-03-01
Name: to_date, dtype: object

In [43]:
#another way
titles_df.to_date.min()

datetime.date(1985, 3, 1)

In [44]:
#another way
min(titles_df['to_date'])

datetime.date(1985, 3, 1)

#### #9 What is the most recent date in the to_date column?

In [48]:
max(titles_df['to_date'])

datetime.date(9999, 1, 1)